#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.uptime_kuma.data.cloudflare_zone.base_zone: Reading...
module.traefik.data.cloudflare_zone.base_zone: Reading...
module.vaultwarden.data.cloudflare_zone.base_zone: Reading...
module.portainer.data.cloudflare_zone.base_zone: Reading...
module.vaultwarden.data.cloudflare_zone.base_zone: Read complete after 0s [id=eada1cc621d9dc058705b9e8dcc97a62]
module.vaultwarden.cloudflare_record.vaultwarden["vw"]: Refreshing state... [id=a0ee4e4ef450d56a1e7d32e4e35ee715]
module.vaultwarden.cloudflare_record.vaultwarden["vaultwarden"]: Refreshing state... [id=180efd5be1a68fdf411f227148ff5d08]
module.vaultwarden.cloudflare_record.vaultwarden["bitwarden"]: Refreshing state... [id=fa70ff03f7ad4f1e3ec74ee0147e818b]
module.vaultwarden.cloudflare_record.vaultwarden["bw"]: Refreshing state... [id=bbacfbc68b10fdd2d04393c1fd224a21]
module.uptime_kuma.data.cloudflare_zone.base_zone: Read complete after 0s [id=eada1cc621d9dc058705b9e8dcc97a62]
module.uptime_kuma.cloudflare_record.uptime_kuma[0]: Refreshing state... [id=48cea55b9c58c2151511235a4908e27a]
module.traefik.data.cloudflare_zone.base_zone: Read complete after 0s [id=eada1cc621d9dc058705b9e8dcc97a62]
module.traefik.cloudflare_record.traefik[0]: Refreshing state... [id=9223d61b246c6b83482f9b88ecd55a8a]
module.traefik.cloudflare_record.authelia[0]: Refreshing state... [id=490df3ceb76f353f75501b26214d5f4f]
module.portainer.data.cloudflare_zone.base_zone: Read complete after 1s [id=eada1cc621d9dc058705b9e8dcc97a62]
module.portainer.cloudflare_record.portainer[0]: Refreshing state... [id=2a0c2d96c2d050a44f79d6c4e93a7e4c]
module.traefik.data.docker_registry_image.socket_proxy: Reading...
module.uptime_kuma.data.docker_registry_image.uptime_kuma: Reading...
module.portainer.docker_network.socket_proxy_portainer: Refreshing state... [id=c82362d681572bcd59cc885b146b754617be888ecd1031ebefaa4f50b2c40aa9]
module.traefik.docker_network.socket_proxy_traefik: Refreshing state... [id=fb62eea7a1f9eceaf119fb113187bc89962376c40102c5c1a6ccfa949f9bd74e]
module.cloudflare_ddns.data.docker_registry_image.cloudflare_ddns: Reading...
module.uptime_kuma.data.docker_registry_image.socket_proxy: Reading...
module.vaultwarden.docker_volume.vaultwarden_data: Refreshing state... [id=vaultwarden-data]
module.vaultwarden.docker_image.vaultwarden: Refreshing state... [id=sha256:c69729042867b9115c3a1af160ab0e4a91dfc848266a55cc524a130eecf0afeccustom-vaultwarden-server]
module.traefik.docker_network.traefik: Refreshing state... [id=ee2e615bd1ae7575a79004993b1a8b70dbeac4f4ade4d185026da5c7a014b366]
module.traefik.docker_volume.letsencrypt: Refreshing state... [id=traefik-letsencrypt]
module.cloudflare_ddns.data.docker_registry_image.cloudflare_ddns: Read complete after 1s [id=sha256:19bd73d8aea9641dc329ec18ae693b2b9c33ff7cdc007f368266ce584446f995]
module.vaultwarden.docker_volume.vaultwarden_rclone_data: Refreshing state... [id=vaultwarden-rclone-data]
module.uptime_kuma.data.docker_registry_image.uptime_kuma: Read complete after 1s [id=sha256:cf61d3262b29e1c48cc2ac284c9264227bbc46168f408e5f4c4d6301f0629e41]
module.portainer.docker_volume.portainer_data: Refreshing state... [id=portainer-data]
module.uptime_kuma.data.docker_registry_image.socket_proxy: Read complete after 1s [id=sha256:6c22b9545adc95258af9deffdde6c0ce0a0a70716771e5a4e02d24d1b6e0dda1]
module.traefik.data.docker_registry_image.authelia: Reading...
module.traefik.data.docker_registry_image.socket_proxy: Read complete after 1s [id=sha256:6c22b9545adc95258af9deffdde6c0ce0a0a70716771e5a4e02d24d1b6e0dda1]
module.vaultwarden.data.docker_registry_image.vaultwarden_backup: Reading...
module.traefik.data.docker_registry_image.authelia: Read complete after 0s [id=sha256:13c28a4780d0bc2efaff14bab1251f6d4da25a0a41c64fb938294691c81befd5]
module.portainer.data.docker_registry_image.portainer: Reading...
module.vaultwarden.data.docker_registry_image.vaultwarden_backup: Read complete after 0s [id=sha256:2f787192695dffe9995a07f43250567d9db218483d7291655c16bffcff73ba1e]
module.uptime_kuma.docker_volume.uptime_kuma_data: Refreshing state... [id=uptime-kuma-data]
module.portainer.data.docker_registry_image.portainer: Read complete after 1s [id=sha256:9fa1ec78b4e29d83593cf9720674b72829c9cdc0db7083a962bc30e64e27f64e]
module.portainer.data.docker_registry_image.socket_proxy: Reading...
module.portainer.data.docker_registry_image.socket_proxy: Read complete after 0s [id=sha256:6c22b9545adc95258af9deffdde6c0ce0a0a70716771e5a4e02d24d1b6e0dda1]
module.uptime_kuma.docker_network.socket_proxy_uptime_kuma: Refreshing state... [id=fbb29a8c53bbb9c037c57b2e41882f79751cd86cd51ef1605adb539305475183]
module.traefik.data.docker_registry_image.traefik: Reading...
module.cloudflare_ddns.docker_image.cloudflare_ddns: Refreshing state... [id=sha256:a2e30a1da73e068365c60fa601778c8ccd4ad134f8ddc1eed39f59070bfe5397oznu/cloudflare-ddns:latest]
module.traefik.data.docker_registry_image.traefik: Read complete after 1s [id=sha256:7607abfb04839f13026b6f0698ab16cdeb8a66aa02045f3fde45dc71df5d2c59]
module.uptime_kuma.docker_image.uptime_kuma: Refreshing state... [id=sha256:f58667a58b2c6f8e2c685f6b3e4a456b00ba4b62a2da8ebba2eccf8f29379cc0index.docker.io/louislam/uptime-kuma:1.18.0]
module.uptime_kuma.docker_image.socket_proxy: Refreshing state... [id=sha256:e419047c5d433fa7f9e45cbf3117255a6114a5e1c66dbef7cd8cbe500bbe16e9ghcr.io/tecnativa/docker-socket-proxy:0.1.1]
module.traefik.docker_image.socket_proxy: Refreshing state... [id=sha256:e419047c5d433fa7f9e45cbf3117255a6114a5e1c66dbef7cd8cbe500bbe16e9ghcr.io/tecnativa/docker-socket-proxy:0.1.1]
module.traefik.docker_image.authelia: Refreshing state... [id=sha256:2912267f695b187050d388f932bfa57c76cb2e00a06e7fb61ff4407bc3407770index.docker.io/authelia/authelia:4.37.1]
module.vaultwarden.docker_image.vaultwarden_backup: Refreshing state... [id=sha256:c60f8e6db5b63abcfaa291836251e2e9826eaa1d5c7b00ccfd8712a7bb0ae588index.docker.io/ttionya/vaultwarden-backup:1.17.0]
module.portainer.docker_image.portainer: Refreshing state... [id=sha256:a87d51c7a32408ba63e65888d023ad7d4328fd575d8a4c8bd8cffa495fcd055cindex.docker.io/portainer/portainer-ce:2.17.1]
module.portainer.docker_image.socket_proxy: Refreshing state... [id=sha256:e419047c5d433fa7f9e45cbf3117255a6114a5e1c66dbef7cd8cbe500bbe16e9ghcr.io/tecnativa/docker-socket-proxy:0.1.1]
module.traefik.docker_image.traefik: Refreshing state... [id=sha256:eebfc9c3c4c6e751b56d305601860e85dbb531ed6e0d79907c3a9cc129ba7bb4index.docker.io/library/traefik:v2.9.9]
module.vaultwarden.docker_container.vaultwarden[0]: Refreshing state... [id=bdab687f6bad0ce66d3fb3cde9dc23cf1dd5642bb266772874be4f10c4aed7bf]
module.traefik.docker_container.authelia[0]: Refreshing state... [id=6f956b41d4fcc11ce8403b5a7a5e08ae0704f97b1d828b2ebe351743e06c43eb]
module.traefik.docker_container.socket_proxy[0]: Refreshing state... [id=a9ed3d20df472f35c9ef8f17fc6a810274b6aa5e0401045c9087385b68d8bd2a]
module.cloudflare_ddns.docker_container.cloudflare_ddns[0]: Refreshing state... [id=a4e2db57e415852adff1d769edb80c5100e1488687c9dc23aa6509e26bd73b88]
module.uptime_kuma.docker_container.socket_proxy[0]: Refreshing state... [id=42bff46841703b64bf9977bcd12ea9a20dbdb23ec861851b06539332516b68da]
module.uptime_kuma.docker_container.uptime_kuma[0]: Refreshing state... [id=c670d5634214acf00d8bc18be49d3d55edd41a47f48e7fddc9c143e04ddeb7cd]
module.portainer.docker_container.socket_proxy[0]: Refreshing state... [id=fe6925e146cd9ee5bebfbfc19869c351c9ce534dc0e619ef7604c8c870dd8b1c]
module.vaultwarden.docker_container.vaultwarden_backup[0]: Refreshing state... [id=14f50a8c0248c4db819fd08d33fb0aa57b4a90c9bd133a3d8a3a6d00046c111a]
module.traefik.docker_container.traefik[0]: Refreshing state... [id=d41e0c5a403ef2fea710743d46a89c22e230a1f4c16b1fd57fc18ad07d6cf168]
module.portainer.docker_container.portainer[0]: Refreshing state... [id=fe45023e6f6360452ebf1de717ddbe64adb0d96c94c556407c5b51a9ecc7be9f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.portainer.docker_image.portainer has been deleted
  - resource "docker_image" "portainer" {
        id            = "sha256:a87d51c7a32408ba63e65888d023ad7d4328fd575d8a4c8bd8cffa495fcd055cindex.docker.io/portainer/portainer-ce:2.17.1"
      - image_id      = "sha256:a87d51c7a32408ba63e65888d023ad7d4328fd575d8a4c8bd8cffa495fcd055c" -> null
        name          = "index.docker.io/portainer/portainer-ce:2.17.1"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.portainer.docker_container.portainer[0] must be replaced
-/+ resource "docker_container" "portainer" {
      + bridge                                      = (known after apply)
      + container_logs                              = (known after apply)
      - cpu_shares                                  = 0 -> null
      - dns                                         = [] -> null
      - dns_opts                                    = [] -> null
      - dns_search                                  = [] -> null
      ~ entrypoint                                  = [
          - "/portainer",
        ] -> (known after apply)
      ~ env                                         = [] -> (known after apply)
      + exit_code                                   = (known after apply)
      - group_add                                   = [] -> null
      ~ hostname                                    = "fe45023e6f63" -> (known after apply)
      ~ id                                          = "fe45023e6f6360452ebf1de717ddbe64adb0d96c94c556407c5b51a9ecc7be9f" -> (known after apply)
      ~ image                                       = "sha256:a87d51c7a32408ba63e65888d023ad7d4328fd575d8a4c8bd8cffa495fcd055c" # forces replacement -> (known after apply)
      ~ init                                        = false -> (known after apply)
      ~ ipc_mode                                    = "private" -> (known after apply)
      ~ log_driver                                  = "json-file" -> (known after apply)
      - log_opts                                    = {} -> null
      - max_retry_count                             = 0 -> null
      - memory                                      = 0 -> null
      - memory_swap                                 = 0 -> null
        name                                        = "portainer"
      ~ network_data                                = [
          - {
              - gateway                   = "172.18.0.1"
              - global_ipv6_address       = ""
              - global_ipv6_prefix_length = 0
              - ip_address                = "172.18.0.6"
              - ip_prefix_length          = 16
              - ipv6_gateway              = ""
              - mac_address               = "02:42:ac:12:00:06"
              - network_name              = "traefik-net"
            },
          - {
              - gateway                   = "172.26.0.1"
              - global_ipv6_address       = ""
              - global_ipv6_prefix_length = 0
              - ip_address                = "172.26.0.3"
              - ip_prefix_length          = 16
              - ipv6_gateway              = ""
              - mac_address               = "02:42:ac:1a:00:03"
              - network_name              = "socket-proxy-portainer-net"
            },
        ] -> (known after apply)
      - network_mode                                = "default" -> null
      - privileged                                  = false -> null
      - publish_all_ports                           = false -> null
      ~ runtime                                     = "runc" -> (known after apply)
      ~ security_opts                               = [] -> (known after apply)
      ~ shm_size                                    = 64 -> (known after apply)
      + stop_signal                                 = (known after apply)
      ~ stop_timeout                                = 0 -> (known after apply)
      - storage_opts                                = {} -> null
      - sysctls                                     = {} -> null
      - tmpfs                                       = {} -> null
      - working_dir                                 = "/" -> null
        # (14 unchanged attributes hidden)

      - volumes {
          - container_path = "/data" -> null
          - read_only      = false -> null
          - volume_name    = "portainer-data" -> null
        }
      + volumes {
          + container_path = "/data"
          + volume_name    = "portainer-data"
        }

        # (12 unchanged blocks hidden)
    }

  # module.portainer.docker_image.portainer will be created
  + resource "docker_image" "portainer" {
      + id            = (known after apply)
      + image_id      = (known after apply)
      + name          = "index.docker.io/portainer/portainer-ce:2.17.1"
      + pull_triggers = [
          + "sha256:9fa1ec78b4e29d83593cf9720674b72829c9cdc0db7083a962bc30e64e27f64e",
        ]
      + repo_digest   = (known after apply)
    }

  # module.uptime_kuma.docker_container.uptime_kuma[0] must be replaced
-/+ resource "docker_container" "uptime_kuma" {
      + bridge                                      = (known after apply)
      ~ command                                     = [
          - "node",
          - "server/server.js",
        ] -> (known after apply)
      + container_logs                              = (known after apply)
      - cpu_shares                                  = 0 -> null
      - dns                                         = [] -> null
      - dns_opts                                    = [] -> null
      - dns_search                                  = [] -> null
      ~ entrypoint                                  = [
          - "/usr/bin/dumb-init",
          - "--",
          - "extra/entrypoint.sh",
        ] -> (known after apply)
      ~ env                                         = [] -> (known after apply)
      + exit_code                                   = (known after apply)
      - group_add                                   = [] -> null
      ~ hostname                                    = "c670d5634214" -> (known after apply)
      ~ id                                          = "c670d5634214acf00d8bc18be49d3d55edd41a47f48e7fddc9c143e04ddeb7cd" -> (known after apply)
      ~ image                                       = "sha256:f58667a58b2c6f8e2c685f6b3e4a456b00ba4b62a2da8ebba2eccf8f29379cc0" # forces replacement -> (known after apply)
      ~ init                                        = false -> (known after apply)
      ~ ipc_mode                                    = "private" -> (known after apply)
      ~ log_driver                                  = "json-file" -> (known after apply)
      - log_opts                                    = {} -> null
      - max_retry_count                             = 0 -> null
      - memory                                      = 0 -> null
      - memory_swap                                 = 0 -> null
        name                                        = "uptime-kuma"
      ~ network_data                                = [
          - {
              - gateway                   = "172.25.0.1"
              - global_ipv6_address       = ""
              - global_ipv6_prefix_length = 0
              - ip_address                = "172.25.0.3"
              - ip_prefix_length          = 16
              - ipv6_gateway              = ""
              - mac_address               = "02:42:ac:19:00:03"
              - network_name              = "socket-proxy-uptime-kuma-net"
            },
          - {
              - gateway                   = "172.18.0.1"
              - global_ipv6_address       = ""
              - global_ipv6_prefix_length = 0
              - ip_address                = "172.18.0.5"
              - ip_prefix_length          = 16
              - ipv6_gateway              = ""
              - mac_address               = "02:42:ac:12:00:05"
              - network_name              = "traefik-net"
            },
        ] -> (known after apply)
      - network_mode                                = "default" -> null
      - privileged                                  = false -> null
      - publish_all_ports                           = false -> null
      ~ runtime                                     = "runc" -> (known after apply)
      ~ security_opts                               = [] -> (known after apply)
      ~ shm_size                                    = 64 -> (known after apply)
      + stop_signal                                 = (known after apply)
      ~ stop_timeout                                = 0 -> (known after apply)
      - storage_opts                                = {} -> null
      - sysctls                                     = {} -> null
      - tmpfs                                       = {} -> null
      - working_dir                                 = "/app" -> null
        # (13 unchanged attributes hidden)

      - healthcheck {
          - interval     = "1m0s" -> null
          - retries      = 5 -> null
          - start_period = "3m0s" -> null
          - test         = [
              - "CMD-SHELL",
              - "node extra/healthcheck.js",
            ] -> null
          - timeout      = "30s" -> null
        }

      - volumes {
          - container_path = "/app/data" -> null
          - read_only      = false -> null
          - volume_name    = "uptime-kuma-data" -> null
        }
      + volumes {
          + container_path = "/app/data"
          + volume_name    = "uptime-kuma-data"
        }

        # (12 unchanged blocks hidden)
    }

  # module.uptime_kuma.docker_image.uptime_kuma must be replaced
-/+ resource "docker_image" "uptime_kuma" {
      ~ id            = "sha256:f58667a58b2c6f8e2c685f6b3e4a456b00ba4b62a2da8ebba2eccf8f29379cc0index.docker.io/louislam/uptime-kuma:1.18.0" -> (known after apply)
      ~ image_id      = "sha256:f58667a58b2c6f8e2c685f6b3e4a456b00ba4b62a2da8ebba2eccf8f29379cc0" -> (known after apply)
      ~ name          = "index.docker.io/louislam/uptime-kuma:1.18.0" -> "index.docker.io/louislam/uptime-kuma:1.21.2" # forces replacement
      ~ pull_triggers = [ # forces replacement
          - "sha256:f9ef2fbca62bb0adbac2a023137f424d927ab0e2ee884882ae287af629fc329f",
          + "sha256:cf61d3262b29e1c48cc2ac284c9264227bbc46168f408e5f4c4d6301f0629e41",
        ]
      ~ repo_digest   = "louislam/uptime-kuma@sha256:f9ef2fbca62bb0adbac2a023137f424d927ab0e2ee884882ae287af629fc329f" -> (known after apply)
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: .plan

To perform exactly these actions, run the following command to apply:
    terraform apply ".plan"

```

</details>

*Pushed by: @nfielder, Action: `pull_request`*